* welcome to org.mode
try to add some text
second line
third line
* this is headline, it starts from one or more starts
if you want to fold(unfold) use `TAB` on heading line
** this is sub-heading (** in beginning prints as one *)
if you want to move-up(down) `ALT+k` or `ALT+j`
** moving around headings
ALT key in Emacs docs named as Meta `M`
promote heading up or down with `M+h` or `M+l`
1. To start numbered list just type `1` and `.`
   next line
   then `M+Enter`
2. and second numbered item in list
* how to use bold italic underlined code verbatim
1. to use bold just add *bold* nice
2. to use italic add /italic/ nice
3. to use underline add _underline_ nice
4. to use code add =int main(int argc, char** argv);= nice
5. to use verbatim add ~verbatim~ (означает дословный)
6. to use strike-throw +some text with strike throw+ nice
** TODO buy airplane
* How to integrate code samples in org
+ define block of code and point in it cursor
+ after it your should call
+ : org-babel-execute-maybe or (C-c C-v C-e)

#+begin_src python
return 'hello from python code!'
#+end_src

#+RESULTS:
: hello from python code!

#+begin_src bash
echo "hello world"
#+end_src

#+RESULTS:
: hello world

#+begin_src C
#include <stdio.h>
int main()
{
    printf("%s", "hello form C lang!\n");
    return 0;
}
#+end_src

#+RESULTS:
: hello form C lang!

#+begin_src cpp
#include <iostream>
int main()
{
    std::cout << "hello world from C++!" << std::endl;
}
#+end_src

#+RESULTS:
: hello world from C++!
